developer-guide.org
:PROPERTIES:
:HTML_CONTAINER_CLASS: title
:END:
#+title: Lilac Developer Guide
#+setupfile: lilac.theme

#+property: header-args :noweb no-export
#+options: H:5

#+bibliography: ./citations.bib

All source code is generated by /tangling/ this Org file
(=developer-guide.org=). This file is the single source of truth for basically
everything. Some other things like COPYRIGHT and LICENSE do not come from this
file, but they are exceptions.

Tangling is done by loading this file into Emacs and then running
=(org-babel-tangle)=. This file is also part of the /woven/ HTML documentation
as =developer-guide.html=, which is referenced by the introductory docs at
=README.html=. The HTML is generated by invoking =(lilac-publish)=. The outputs
of both tangling and weaving are checked into version control.

The =Makefile= in this repo is used as the main "driver" for both tangling and
weaving. Typically, you would have a browser pointed to =README.html= or
=developer-guide.html= (whichever one you are working on) and refresh it after
editing the corresponding Org file. After every change to the Org file, you can
run =make= to tangle, weave, and run unit tests.

* Development environment (Nix shell)

This is the main development shell and brings in all of our dependencies to
build all of our code. Taken from [[https://github.com/tweag/haskell-stack-nix-example/blob/b9383e35416a2b0e21fbc97ed079538f9f395b6a/shell.nix#L1][here]]. The =Makefile= is meant to be executed
from within this environment.

#+name: shell.nix
#+caption: shell.nix
#+begin_src nix :tangle shell.nix :eval no
let
  # Nixpkgs snapshot.
  sources = import ./package/nix/sources.nix;
  # The final "pkgs" attribute.
  pkgs = import sources.nixpkgs {};
in

# This is our development shell.
pkgs.mkShell ({
  buildInputs = [
    # Tangling and weaving for Literate Programming.
    pkgs.emacs29-nox

    # Spell checking.
    pkgs.typos

    # Update Nix dependencies in package/nix/sources.nix.
    pkgs.niv

    # Misc.
    pkgs.git
    pkgs.less
  ];
})
#+end_src

For Emacs, we use the "nox" version to avoid GUI dependencies (because we always
invoke Emacs in batch mode in the terminal without ever using it in an
interactive manner).

* Makefile

We have a top-level =Makefile= so that we can run some =make= commands on the
command line. The overall idea is to tangle and weave, while also running any
associated tests.

Note that we make use of the fake file =tangle=, so that we can write the
top-level =test= rule as =test: tangle=, which reads more naturally than the
equivalent =test: Makefile= or =test: lilac.el=.

#+name: Makefile
#+caption: Makefile
#+begin_src makefile :tangle Makefile :eval no
all: test weave
.PHONY: all

test: tangle
	LILAC_ROOT=$(LILAC_ROOT) emacs --quick --batch --kill --load ert \
		--load lilac.el \
		--load lilac-tests.el \
		--funcall ert-run-tests-batch-and-exit
.PHONY: test

__NREF__Makefile-weave
__NREF__Makefile-tangle
__NREF__Makefile-run_emacs
__NREF__Makefile-lint
__NREF__Makefile-update-deps
#+end_src

Weaving just depends on the main =README.html= and =developer-guide= files being
generated. Before we call =(lilac-publish)=, we have to first call
=(lilac-gen-css-and-exit)= because otherwise the source code blocks do not get
any syntax highlighting.

#+name: __NREF__Makefile-weave
#+begin_src makefile
weave: lint README.html developer-guide.html
.PHONY: weave

README.html syntax-highlighting.css &: README.org
	$(call run_emacs,(lilac-gen-css-and-exit),$<)
	$(call run_emacs,(lilac-publish),$<)

developer-guide.html syntax-highlighting.css &: developer-guide.org
	$(call run_emacs,(lilac-gen-css-and-exit),$<)
	$(call run_emacs,(lilac-publish),$<)
#+end_src

Tangling is pretty straightforward --- we just need to call
=(org-babel-tangle)= on =developer-guide.org= (the =README.org= does not contain
any code we need to run to make this work). This generates a number of files,
such as the =Makefile= and =shell.nix=.

The key here is to enumerate these generated files, because we need to tell the
=make= utility that it should run the rule if =developer-guide.org= has a newer
modification timestamp than any of the generated files. Technically speaking,
because all of the tangled files are tangled together at once with
=(org-babel-tangle)=, we could just list one of them such as =Makefile= (instead
of enumerating all of them). However we still enumerate them all here for
completeness.

#+name: __NREF__Makefile-tangle
#+begin_src makefile
# tangled_output are all files that are generated by tangling developer-guide.org.
tangled_output = \
	citations.bib \
	lilac.css \
	lilac.el \
	lilac-tests.el \
	lilac.js \
	lilac.theme \
	.gitattributes \
	.gitignore \
	Makefile \
	shell.nix

tangle $(tangled_output) &: developer-guide.org
	# Generate the toplevel Makefile (this file) and others as described in
	# tangled_output. In a way this bootstraps the whole literate-programming
	# pipeline.
	$(call run_emacs,(org-babel-tangle),developer-guide.org)
	touch tangle
#+end_src

The =run_emacs= function is used for both weaving and tangling. The main thing
of interest here is that it loads the =lilac.el= (tangled) file before
evaluating the given expression.

#+name: __NREF__Makefile-run_emacs
#+begin_src makefile
define run_emacs
	LILAC_ROOT=$(LILAC_ROOT) emacs $(2) --quick --batch --kill \
		--load $(LILAC_ROOT)/lilac.el --eval="$(1)"
endef

LILAC_ROOT := $(shell git rev-parse --show-toplevel)
#+end_src

We use [[https://github.com/nmattia/niv][=niv=]] to update the dependencies sourced by [[shell.nix][=shell.nix=]]. Niv uses two
sources of truth: the niv repository itself on GitHub, and a branch of nixpkgs.
The former tracks the =master= branch, and the latter tracks the stable channels
(example: =nixos-23.05= branch). Whenever we run =niv update=, =niv= will update
the HEAD commit SHA of these branches.

One problem with the nixpkgs stable channel is that it will eventually become
obsolete as newer stable channels get created. So we have to manually track
these channels ourselves.

#+name: __NREF__Makefile-update-deps
#+begin_src makefile
nixpkgs_stable_channel := nixos-23.05
update-deps: package/nix/sources.json package/nix/sources.nix
	cd package && niv update nixpkgs --branch $(nixpkgs_stable_channel)
	cd package && niv update
	touch update-deps
#+end_src

** Linting

*** Spell checker

We use [[https://crates.io/crates/typos-cli][typos-cli]] to check for spelling errors. Below we configure it to only
check the original source material --- Org files.

#+name: _typos.toml
#+caption: _typos.toml
#+begin_src toml :tangle _typos.toml :eval no
[files]
extend-exclude = [
    "*.html",
    "deps/*",
]
#+end_src

Here we have the Makefile rules for linting, which include this spellchecker.

#+name: __NREF__Makefile-lint
#+begin_src makefile
lint: spellcheck
.PHONY: lint

spellcheck: README.org developer-guide.org
	typos
.PHONY: spellcheck
#+end_src

* Tangling (generating the source code)

Tangling is simply the act of collecting the =#+begin_src ... #+end_src= blocks
and arranging them into the various target (source code) files. Every source
code block is given a unique name.

We simply tangle the =developer-guide.org= file to get all the code we need.

The only thing that we customize in terms of tangling is how we define Noweb
references inside source code blocks.

** Custom Noweb delimiters

By default, Org mode requires Noweb source code references to be delimited with
double angled brackets (=<<= and =>>=). This presents two problems:

1. The biggest problem with this is that it interferes with syntax highlighting,
   especially because different programming languages treat these brackets in a
   different manner (it may be a particular type of token in one language, but a
   different one in another).
1. It's also slightly annoying because when searching inside an editor such as
   Vim (or even Emacs with the Org mode on), the angle brackets are not
   considered part of the word being searched. This means that if the source
   code block shares the same name as another (unrelated) string, the search
   results for both are combined into one.

To avoid these problems, we simply make Noweb references use a =__NREF__=
prefix. We also define a suffix group such that the reference can take an
argument to the code block itself. See the example in FIXME.

Note that because this is a customization, we cannot run ~C-c C-v t~ to tangle
code blocks properly in an interactive manner from an Emacs editing session of
this Org file, without first evaluating the bits of code in the following code
block.

#+name: __NREF__lilac_dot_el-custom-noweb-delimiters
#+begin_src emacs-lisp :noweb no
(setq org-babel-noweb-wrap-start "__NREF__")
(setq org-babel-noweb-wrap-end "")

(defun lilac-nref-rx (match-optional-params)
  (rx-to-string
   (lilac-nref-rx-primitive match-optional-params)))

(defun lilac-nref-rx-primitive (match-optional-params)
  (if match-optional-params
   `(group
           "__NREF__"
          ;; Noweb reference must start with a letter...
          (any alpha)
          ;; ...and must be followed by
          ;; letters,numbers,dashes,underscores,periods...
          (* (or (any alnum) "-" "_" "."))
          ;; ...and may terminate with a "(...)" where the "..." may be an empty
          ;; string, or some other argument.
          (* (or "()"
                 (and "("
                      (* (not ")"))
                      ")"))))
   `(group
          "__NREF__"
          (any alpha)
          (* (or (any alnum) "-" "_" ".")))))

;; Customize noweb delimiters. Unlike traditional << and >> delimiters, we just
;; use the "__NREF__" prefix as our only delimiter. This has the advantage of
;; being encoded the same way into HTML, which makes our HTML modifications
;; easier and more consistent across different source code languages.
;; See https://emacs.stackexchange.com/a/73720/13006.
(defun org-babel-noweb-wrap (&optional regexp)
  "Return regexp matching a Noweb reference.

Match any reference, or only those matching REGEXP, if non-nil.
When matching, reference is stored in match group 1."
  (lilac-nref-rx t))
#+end_src

** Allow evaluation of code blocks

Some code blocks are generated by evaluating code in other blocks. This way, you
can use all the power of Org mode (as well as any supported programming
language) as a kind of meta-programming system.

Orgmode by default disables automatic evaluation of source code blocks, because
it is a big security risk. For us, we know that we want to allow code
evaluation, so we disable the evaluation confirmation check. This way,
evaluation can still work even in batch mode.

#+header: :noweb-ref __NREF__lilac_dot_el-allow-code-evaluation
#+begin_src emacs-lisp
(setq org-confirm-babel-evaluate nil)
#+end_src

The following is needed to evaluate the example for source code block evaluation
in [[file:README.org::#h-Monoblock--evaluation-result-s-value][Monoblock (evaluation result's value)]], which evaluates Python. We don't
need to add in Emacs lisp here because it's already supported by default (which
we take advantage of in [[* Create =lilac.theme= file]]).

#+header: :noweb-ref __NREF__lilac_dot_el-allow-code-evaluation
#+begin_src emacs-lisp
(org-babel-do-load-languages 'org-babel-load-languages
                             (append org-babel-load-languages
                              '((python     . t))))
#+end_src

* Weaving (generating the HTML)

Weaving is conceptually simpler than tangling because there is no extra step ---
the output is an HTML page and that is something that we can use directly
(unlike program source code, which may require additional compilation into a
binary, depending on the language). We limit ourselves to HTML output because
HTML support is ubiquitous; plus we don't have to worry about page breaks such
as in PDF output.

Although weaving is conceptually simple, most of the code in [[file:lilac.el][=lilac.el=]] have to
do with weaving because the default infrastructure that ships with Org mode is
too rigid for our needs. For example, we make heavy use of Noweb-style
[cite:@ramsey_1994] references, but also add in extensive HTML links to allow
the reader to jump around code easily because Org does not cross-link these
references by default.

Weaving currently requires the following dependencies:

| Dependency | Why                      |
|------------+--------------------------|
| [[https://www.gnu.org/software/make/][GNU Make]]   | to run "make"            |
| [[https://www.gnu.org/software/emacs/][GNU Emacs]]  | for tangling and weaving |

Note that all of the above can be brought in by using the [[https://github.com/NixOS/nix][Nix package manager]].
This is why we provide a [[shell.nix][=shell.nix=]] [[file:shell.nix][file]] in this repo.

