developer-guide.org
*** Automatic captions for Noweb source code blocks

For the parent/child source code blocks, we simply build these up by having
blocks named =#+name: __NREF__foo= or =#+header: :noweb-ref __NREF__foo=. Each
of these blocks can also reference other blocks by having a line =__NREF__bar=
inside its body. When defining such blocks, we really don't want to define the
=#+caption: ...= part manually because it gets tedious rather quickly. Yet we
still have to have these =#+caption: ...= bits (/for every =__NREF__...=
block!/) because that's the only way that Org's HTML exporter knows how to label
these blocks.

The code in this section automatically generates =#+caption: ...= text for these
=__NREF__...= blocks.

We want each =#+caption: ...= text to have the following items:

- [[(NSCB_NAME)][=NSCB_NAME=]] :: name of the Noweb source code block,
- [[(NSCB_POLYBLOCK_INDICATOR)][=NSCB_POLYBLOCK_INDICATOR=]] :: an indicator to show whether this block is
  broken up over multiple blocks, and
- [[(NSCB_LINKS_TO_PARENTS)][=NSCB_LINKS_TO_PARENTS=]] :: a link back up to a parent block (if any) where
  this block is used; can contain more than 1 parent if multiple parents refer
  to this same child block

/NSCB/ here means /Noweb source code block/. We loop through every source code
block and insert a =#+caption: ...= text into the buffer. This modified buffer
(with the three bits of information from above) is what is sent down the
pipeline for final export to HTML (i.e., the buffer modification does not affect
the actual buffer (=*.org= file)).

So assume that we already have the smart captions in a sorted [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Association-Lists.html][association list]]
(aka alist), where the KEY is the integer buffer position where this caption
should be inserted, and the VALUE is the caption itself (a string), like this:

#+caption: Caption locations
#+begin_src elisp
'((153  . "#+caption: ...")
  (384  . "#+caption: ...")
  (555  . "#+caption: ...")
  (684  . "#+caption: ...")
  (1051 . "#+caption: ..."))
#+end_src

We can use the KEY to go to that buffer position and insert the caption. However
the insertion operation mutates the buffer. This means if we perform the
insertions top-to-bottom, the subsequent KEY values will become obsolete. The
trick then is to just do the insertions in reverse order (bottom-to-top), so
that the remaining KEY values remain valid. This is what we do below, where
=smart-captions= is an alist like the one just described.

#+name: __NREF__smart-source-code-block-captions
#+begin_src emacs-lisp
(defun lilac-insert-noweb-source-code-block-captions (_backend)
  (let* ((parent-blocks
           __NREF__parent-blocks)
         (child-parents-hash-table
           __NREF__child-parents-hash-table)
         (all-src-blocks
           __NREF__all-src-blocks)
         (smart-captions
           __NREF__smart-captions))
    (lilac-insert-strings-into-buffer smart-captions)))

__NREF__smart-source-code-block-captions-helpers
#+end_src

(We'll get to the helper functions =smart-source-code-block-captions-helpers=
later as they obscure the big picture.)

Now we just have to construct =smart-captions=. The main difficulty is the
construction of [[(NSCB_LINKS_TO_PARENTS)][=NSCB_LINKS_TO_PARENTS=]], so most of the code will be concerned
about child-parent associations.

Why do we even need these source code blocks to link back to their parents? The
point is to make things easier to navigate. For example, if we have

#+caption: Sample Org-mode Noweb-style references
#+begin_src org
,#+name: parent-block
,#+begin_src bash
echo "Hello from the parent block"
__NREF__child-block-1
__NREF__child-block-2
,#+end_src

...

,#+name: __NREF__child-block-1
,#+begin_src bash
echo "I am child 1"
,#+end_src

...

,#+header: :noweb-ref __NREF__child-block-2
,#+begin_src bash
echo -n "I am "
,#+end_src

,#+header: :noweb-ref __NREF__child-block-2
,#+begin_src bash
echo "child 2"
,#+end_src
#+end_src

and we export this to HTML, ideally we would want both =__NREF__child-block-1=
and each of the =__NREF__child-block-2= blocks to include an HTML link back up
to =parent-block=. This would make it easier to skim the document and not get
too lost (any time you are looking at any particular source code block, you
would be able to just click on the link back to the parent (if there is one) to
see a higher-level view).

The key idea here is to build a hash table (=child-parents-hash-table=) where
the KEY is a child source code block and the VALUE is the parent block(s). Then
in order to construct [[(NSCB_LINKS_TO_PARENTS)][=NSCB_LINKS_TO_PARENTS=]] we just do a lookup against this
hash table to find the parent(s), if any.

The first thing we need is a list of parent source code blocks. We consider a
source code block a parent block if it has any Noweb references within its body.

#+name: __NREF__parent-blocks
#+begin_src emacs-lisp
(lilac-get-parent-blocks)
#+end_src

Then we construct the =child-parents-hash-table=. For each parent block, we get
all of its children (=child-names=), and use this data to construct a
child-parent association. Note that we use =cl-pushnew= instead of =push= to
deduplicate parents (i.e., when a single parent refers to the same child more
than once we do not want to link back to this same parent more than once from
the child block's caption).

#+name: __NREF__child-parents-hash-table
#+begin_src emacs-lisp
(lilac-mk-child-parents-hash-table parent-blocks)
#+end_src

Now that we have the child-parent associations, we have to look at all source
code blocks and check if

1. this source code block's name shows up at all in =child-parents-hash-table=,
   and if so
2. add a link to the parent ([[(NSCB_LINKS_TO_PARENTS)][=NSCB_LINKS_TO_PARENTS=]]).

Let's grab all source code blocks:

#+name: __NREF__all-src-blocks
#+begin_src emacs-lisp
(org-element-map (org-element-parse-buffer) 'src-block 'identity)
#+end_src

And now we can finally construct =smart-captions=:

#+name: __NREF__smart-captions
#+begin_src emacs-lisp
(lilac-mk-smart-captions child-parents-hash-table)
#+end_src

We used some helper functions up in [[__NREF__smart-source-code-block-captions][=__NREF__smart-source-code-block-captions=]];
let's examine them now.

=lilac-is-parent-block= checks whether a source code block is a parent (contains
noweb references to other child blocks in the form =__NREF__child-name=).

#+header: :noweb-ref __NREF__smart-source-code-block-captions-helpers
#+begin_src emacs-lisp
(defun lilac-is-parent-block (src-block)
  (let ((body (org-element-property :value src-block)))
    (lilac-get-noweb-children body)))
#+end_src

=lilac-get-parent-blocks= retrieves all source code blocks that are parents
(which have =__NREF__...= references).

#+header: :noweb-ref __NREF__smart-source-code-block-captions-helpers
#+begin_src emacs-lisp
(defun lilac-get-parent-blocks ()
  (org-element-map (org-element-parse-buffer) 'src-block
    (lambda (src-block)
       (if (lilac-is-parent-block src-block) src-block))))
#+end_src

=lilac-mk-child-parents-hash-table= takes all parent source code blocks and
generates a hash table where the KEY is the child block name and the VALUE is
the list of parents that refer to the child. When we loop through
=parent-blocks= below, we have to first =reverse= it because the function
=cl-pushnew= grows the list by prepending to it.

#+header: :noweb-ref __NREF__smart-source-code-block-captions-helpers
#+begin_src emacs-lisp
(defun lilac-mk-child-parents-hash-table (parent-blocks)
  (let ((hash-table (make-hash-table :test 'equal)))
    (mapc
     (lambda (parent-block)
      (let* ((parent-name (org-element-property :name parent-block))
             (parent-body (org-element-property :value parent-block))
             (child-names (lilac-get-noweb-children parent-body)))
        (mapc (lambda (child-name)
                (let* ((parents (gethash child-name hash-table)))
                  (if parents
                    (puthash child-name
                             (cl-pushnew parent-name parents)
                             hash-table)
                    (puthash child-name (list parent-name) hash-table))))
              child-names)))
     (reverse parent-blocks))
    hash-table))
#+end_src

=lilac-mk-smart-captions= generates an alist of buffer positions (positive
integer) and the literal =#+caption: ...= text that needs to be inserted back
into the buffer.

#+header: :noweb-ref __NREF__smart-source-code-block-captions-helpers
#+begin_src emacs-lisp -r -l ";ref:%s"
(defun lilac-mk-smart-captions (child-parents-hash-table)
  (-remove 'null
    (cl-loop for src-block in __NREF__all-src-blocks collect
      (let* ((child (lilac-get-src-block-name src-block))
             (child-name (car child))
             (NSCB_NAME (format "=%s= " child-name))                  ;ref:NSCB_NAME
             (NSCB_POLYBLOCK_INDICATOR                                ;ref:NSCB_POLYBLOCK_INDICATOR
               (if (lilac-get-noweb-ref-polyblock-name src-block)
                   "(polyblock)"
                 ""))
             (polyblock-counter
              (gethash child-name lilac-polyblock-names-totals 0))
             (polyblock-counter-incremented
              (puthash child-name (1+ polyblock-counter)
                       lilac-polyblock-names-totals))
             (parents (gethash child-name child-parents-hash-table))
             (parents-zipped (lilac-enumerate parents))
             (pos (org-element-property :begin src-block))
             (NSCB_LINKS_TO_PARENTS                                   ;ref:NSCB_LINKS_TO_PARENTS
              (mapconcat (lambda (parent-with-idx)
                           (format " [[%s][%d]]"
                                   (nth 1 parent-with-idx)
                                   (1+ (nth 0 parent-with-idx))))
                         parents-zipped " "))
             (smart-caption
              (concat
                "#+caption: "
                NSCB_NAME
                NSCB_POLYBLOCK_INDICATOR
                NSCB_LINKS_TO_PARENTS
                "\n")))
        (when parents (cons pos smart-caption))))))
#+end_src

=lilac-insert-strings-into-buffer= takes an alist of buffer positions and
strings and inserts them all into the buffer.

#+header: :noweb-ref __NREF__smart-source-code-block-captions-helpers
#+begin_src emacs-lisp
(defun lilac-insert-strings-into-buffer (pos-strings)
  (cl-loop for pos-string in (reverse pos-strings) do
        (let ((pos (car pos-string))
              (str (cdr pos-string)))
          (goto-char pos)
          (insert str))))
#+end_src

=lilac-get-noweb-children= extracts all Noweb references in the form
"=__NREF__foo=" from a given multiline string, returning a list of all such
references. This function expects at most 1 Noweb reference per line. The return
type is a list of strings.

#+header: :noweb-ref __NREF__smart-source-code-block-captions-helpers
#+begin_src emacs-lisp
(defun lilac-get-noweb-children (s)
  (let* ((lines (split-string s "\n"))
         (refs (-remove 'null
                 (mapcar
                  (lambda (line)
                   (if (string-match (lilac-nref-rx nil) line)
                       (match-string-no-properties 1 line)))
                  lines))))
    refs))
#+end_src

=lilac-get-noweb-ref-polyblock-name= gets the string =__NREF__foo= in a
=#+header: :noweb-ref __NREF__foo= line for a source code block.

#+header: :noweb-ref __NREF__smart-source-code-block-captions-helpers
#+begin_src emacs-lisp
(defun lilac-get-noweb-ref-polyblock-name (source-code-block)
  (let* ((headers (org-element-property :header source-code-block))
         (noweb-ref-name
          (nth 0
           (-remove 'null
            (mapcar
             (lambda (header)
               (if (string-match ":noweb-ref \\(.+\\)" header)
                   (match-string-no-properties 1 header)))
             headers)))))
    noweb-ref-name))
#+end_src

Note that a child source block can have two ways of defining its name. The first
is with the direct =#+name: __NREF__foo= style ([[glossary: monoblock][monoblock]]), and the second way
is with a line like =#+header: :noweb-ref __NREF__foo= ([[glossary: polyblock][polyblock]]). Here
=lilac-get-src-block-name= grabs the name of a (child) source code block, taking
into account these two styles. For polyblock names, we mark it as such with a
=(polyblock)= string, which is used later for the [[(NSCB_POLYBLOCK_INDICATOR)][=NSCB_POLYBLOCK_INDICATOR=]].

#+header: :noweb-ref __NREF__smart-source-code-block-captions-helpers
#+begin_src emacs-lisp
(defun lilac-get-src-block-name (src-block)
  (let* ((name-direct (org-element-property :name src-block))
         (name-indirect (lilac-get-noweb-ref-polyblock-name src-block)))
    (if name-indirect
        `(,name-indirect "(polyblock)")
        `(,name-direct ""))))
#+end_src

Next we have some helpers to enumerate through a list just like in Python. The
index starts at 0 (same as Python).

#+header: :noweb-ref __NREF__smart-source-code-block-captions-helpers
#+begin_src emacs-lisp
(defun lilac-enumerate (lst &optional start)
  (let ((ret ()))
    (cl-loop for index from (if start start 0)
           for item in lst
           do (push (list index item) ret))
    (reverse ret)))

; See https://emacs.stackexchange.com/a/7150.
(defun lilac-matches (regexp s &optional group)
  "Get a list of all regexp matches in a string"
  (if (= (length s) 0)
      ()
      (save-match-data
        (let ((pos 0)
              (matches ()))
          (while (string-match regexp s pos)
            (push (match-string (if group group 0) s) matches)
            (setq pos (match-end 0)))
          (reverse matches)))))
#+end_src

