developer-guide.org
*** Link noweb references (link to child block from parent block)

In [[* Pretty source code captions]] we tweaked the HTML so that source code blocks
could link back up to their parents. In this section we are concerned with the
opposite --- linking to child blocks from the parents. For example, consider the
following code:

#+caption: Sample Org-mode Noweb-style references
#+begin_src org
,#+name: parent-block
,#+begin_src bash
echo "Hello from the parent block"
__NREF__child-block-1
__NREF__child-block-2
,#+end_src

...

,#+name: __NREF__child-block-1
,#+begin_src bash
echo "I am child 1"
,#+end_src

...

,#+header: :noweb-ref __NREF__child-block-2
,#+begin_src bash
echo -n "I am "
,#+end_src

,#+header: :noweb-ref __NREF__child-block-2
,#+begin_src bash
echo "child 2"
,#+end_src
#+end_src

What we want to do is to make the =__NREF__child-block-1= and
=__NREF__child-block-2= references inside =parent-block= to link to their
definitions, so that the reader can just click on them to go to see how they're
defined. Unfortunately Org mode doesn't do this by default so we have to do this
ourselves.

In the case of =__NREF__child-block-2=, it is defined in multiple blocks so we
would want to link to the very first block.

We cannot use a =org-export-before-parsing-hook= like we did in [[* Toplevel
 publishing function (=lilac-publish=)]] because at that stage of processing, we
are dealing with Org mode syntax. Any modifications we make to the parent
source code block will be treated as text upon HTML export. Thankfully Org mode
allows customizations on generated HTML through the
=org-export-filter-src-block-functions= variable. This variable is analogous to
=org-export-before-parsing-hook=, but operates at the HTML level (not at the
Org syntax level) for source code blocks, which is exactly what we need.

So we have to craft valid HTML links (not Org links) to the child source code
blocks. For this we need the actual =id= part of the HTML =<pre>...= block that
will hold the source code. That is, the algorithm should be something like:

1. for every parent source code block,
2. for every child block (noweb) referenced in the body, insert an HTML link to
   the child block (lookup in =lilac-child-HTML_ID-hash-table=).

The only thing remaining is the construction of
=lilac-child-HTML_ID-hash-table=. We can construct this by mapping through all
source code blocks and getting the name which can be just drawn from the =<label
...>= HTML tag, thanks to the smart captions we inserted for all child blocks
earlier in [[* Automatic captions for Noweb source code blocks]]. This hash table
will hold mappings from child source block names to their HTML ID's.

Now that we have a high-level understanding, let's walk through the
implementation. First here's the code to populate the
=lilac-child-HTML_ID-hash-table=.

#+header: :noweb-ref __NREF__lilac-link-to-child-blocks-from-parent
#+begin_src emacs-lisp -r -l ";ref:%s"
(setq lilac-child-HTML_ID-hash-table (make-hash-table :test 'equal))

(defun lilac-populate-child-HTML_ID-hash-table (src-block-html backend info)
  (when (org-export-derived-backend-p backend 'html)
    (let* ((child-name (lilac-get-src-block-name-from-html src-block-html))
           (child-HTML_ID (lilac-get-src-block-HTML_ID src-block-html))
           (child-HTML_ID-exists-already
            (gethash child-name lilac-child-HTML_ID-hash-table nil)))
      ; Only process child blocks that have an HTML ID.
      (if (and child-HTML_ID (not child-HTML_ID-exists-already))
          (puthash child-name child-HTML_ID lilac-child-HTML_ID-hash-table))
      ; Return src-block-html as-is (no modifications).
      src-block-html)))

;ref:lilac-get-src-block-HTML_ID
(defun lilac-get-src-block-HTML_ID (src-block-html)
  (let ((match (string-match "<pre [^>]+?id=\"\\([^\"]+\\)\">" src-block-html)))
    (if match (match-string-no-properties 1 src-block-html))))
#+end_src

We need to get the source block name (the name of the child) from the HTML. We
do this in =lilac-get-src-block-name-from-html= below. Either there is a
=__NREF__...= text in the =<code>= tag within a =<label>= tag (from [[* Automatic
captions for Noweb source code blocks]]), or there is just a plain  =<label>= as
a result of a manually-written =#+caption: ...= bit. We use either one. Note
that the latter category assumes that the user used unique caption labels for
all blocks; if the user manually creates non-unique captions, this will probably
break. (FIXME: add test to confirm breakage...?)

#+header: :noweb-ref __NREF__lilac-link-to-child-blocks-from-parent
#+begin_src emacs-lisp -r -l ";ref:%s"
(defun lilac-get-src-block-name-from-html (src-block-html)
  (let* ((match-nref (string-match
                      (concat
                       "<label.+?<code>"
                       (lilac-nref-rx nil)
                       "</code>")
                      src-block-html))
         (match-raw (if (not match-nref)
                        (string-match
                         (rx-to-string
                          '(and
                            "<label"
                            (+ (not ">"))
                            ">"
                            (group (*? anychar))
                            "</label>"))
                         src-block-html)))
         (matched-contents (match-string-no-properties 1 src-block-html)))
    (if match-nref
        matched-contents
        (if match-raw
            (lilac-clean-up-match-raw matched-contents)))))
#+end_src

If the user used manual captions, we have to remove the "Listing N: ..." text
that Org automatically inserts.

#+header: :noweb-ref __NREF__lilac-link-to-child-blocks-from-parent
#+begin_src emacs-lisp -r -l ";ref:%s"
(defun lilac-clean-up-match-raw (s)
  (let* ((normalized (lilac-normalize-string s))
         (rx (rx-to-string
                '(and
                  "Listing-"
                  (+ (any digit))
                  (+ "-")
                  "span"
                  (* "-")
                  (group (+ anychar)))))
         (match (string-match rx normalized)))
    (if match
        (match-string-no-properties 1 normalized)
        normalized)))
#+end_src

Now we have everything we need to add HTML links into the body of the source
code block directly. We search for the child name (which begins with a
=__NREF__...=, which is defined in =lilac-nref-rx=), and perform a string
replacement, adding in the link to the child block.

#+header: :noweb-ref __NREF__lilac-link-to-child-blocks-from-parent
#+begin_src emacs-lisp -r -l ";ref:%s"
(defun lilac-link-to-children-from-parent-body (src-block-html backend info)
  (when (org-export-derived-backend-p backend 'html)
    (let* ((div-caption-body (lilac-get-source-block-html-parts-without-newlines
                              src-block-html))
           (leading-div (nth 0 div-caption-body))
           (caption (nth 1 div-caption-body))
           (body (nth 2 div-caption-body))
           (body-linkified-without-newlines
            (replace-regexp-in-string
             (lilac-nref-rx nil)
             (lambda (child-name-text)
                 (let* ((HTML_ID (gethash child-name-text
                                          lilac-child-HTML_ID-hash-table)))
                  (if HTML_ID
                      (concat "<span class=\"lilac-child-link-from-parent\">"
                              "<a href=\"#" HTML_ID "\">"
                              (string-remove-prefix "__NREF__" child-name-text)
                              "</a></span>")
                      child-name-text)))
             body))
           (body-linkified-with-newlines
            (lilac-to-multi-line body-linkified-without-newlines)))
      (concat leading-div caption body-linkified-with-newlines "</div>"))))
#+end_src

*** Search and replace hardcoded things

Org's HTML export hardcodes some things. We have to do some manual surgery to
set things right. First let's define a generic search-and-replace function. This
function is based on [[https://emacs.stackexchange.com/a/2382/13006][this example]].

#+header: :noweb-ref __NREF__lilac_dot_el-search-replace
#+begin_src emacs-lisp
(defun lilac-replace-from-to (str repl)
  (interactive "sString: \nsReplacement: ")
  (save-excursion
    (goto-char (point-min))
    (replace-string str repl)))
#+end_src

Here's a basic wrapper to perform the string replacement for an HTML file based
on the current buffer name.

#+header: :noweb-ref __NREF__lilac_dot_el-search-replace
#+begin_src emacs-lisp
(defun lilac-replace-from-to-html (str repl &optional regex)
  (let ((html-file-name (concat
                         (file-name-sans-extension (buffer-file-name))
                         ".html")))
    (find-file html-file-name)
    (goto-char 0)
    (if regex
        (replace-regexp str repl)
        (lilac-replace-from-to str repl))
    (save-buffer)))
#+end_src

Now we do some basic search-and-replace commands to clean up the exported HTML
file from Emacs (instead of invoking =sed=).

**** MathJax with line breaking support

Surprisingly, MathJax v3 (which Org ships with) [[https://github.com/mathjax/MathJax/issues/2312][does not support manual line
breaks]]. However, line breaks are supported in the new [[https://github.com/mathjax/MathJax/releases/tag/4.0.0-beta.4][v4 alpha version]]. So use
that.

#+name: __NREF__lilac-publish-fix-mathjax-version
#+begin_src emacs-lisp
(lilac-replace-from-to-html
 "mathjax@3/es5/tex-mml-chtml.js\">"
 "mathjax@4.0.0-beta.4/tex-mml-chtml.js\">")
#+end_src

We have to include the trailing (and somewhat redundant) =\">= so that the
function does not replace the text above as well as the intended raw HTML
(hardcoded) bits that we want to replace.

**** Bibliography (citations)

This cleans up the inline styles for citations. Again we include some additional
characters in the pattern (notably the left angle bracket (=<=)) so that the
text below itself does not get recognized and replaced.

#+name: __NREF__lilac-publish-fix-inline-styles
#+begin_src emacs-lisp
(lilac-replace-from-to-html
 ".csl-right-inline{margin: 0 0 0 1em;}<"
 ".csl-right-inline{margin: 0 0 0 2em;}<")
#+end_src

We also do some replacements for the bibliography entries themselves. Namely,
each entry has the following (odd) structure by default:

#+begin_example
<div class="csl-entry"><a id="citeproc_bib_item_1"></a> ... </div>
#+end_example

and instead we delete the content-less link anchor and instead move th ID to the
parent div, like this:

#+begin_example
<div class="csl-entry" id="citeproc_bib_item_1"> ... </div>
#+end_example

This way we can target this surrounding parent div for the =active= HTML class
attribute (instead of the empty link anchor) to style the entire entry when we
click a link to go to it.

#+name: __NREF__lilac-publish-fix-bibliography-ids
#+begin_src emacs-lisp
(lilac-replace-from-to-html
 "\"csl-entry\"><a \\(id=\"[^\"]+\"\\)></a>"
 "\"csl-entry\" \\1>"
 t)
#+end_src

And here we style these entries.

#+name: __NREF__css-bibliography
#+begin_src css
.csl-entry {
    padding: 0.5em;
    border-style: solid;
    border-width: 1px;
    border-radius: 5px;
    border-color: var(--clear);
}

.outline-2 .csl-bib-body .active {
    __NREF__css-active-item-headline
}
#+end_src

**** Glossary (description lists)

Similar to the bibliography entries, the description lists in HTML have empty
link anchors in them, because of the way we insert the link anchors manually in
the Org text (this is a convention we follow; see the [[* Glossary]] for examples).
We get rid of these anchors and instead create a surrounding div around it, so
that we can highlight the enclosed =<dt>= (description term) and =<dd>=
(description details).

#+name: __NREF__lilac-publish-fix-description-lists
#+begin_src emacs-lisp
(lilac-replace-from-to-html
 "<dt>"
 "<div class=\"lilac-description-list-entry\"><dt>"
 t)
(lilac-replace-from-to-html
 "\"lilac-description-list-entry\"><dt><a \\(id=\"[^\"]+\"\\)></a>"
 "\"lilac-description-list-entry\" \\1><dt>"
 t)
(lilac-replace-from-to-html
 "</dd>"
 "</dd></div>")
#+end_src

And here we style it.

#+name: __NREF__css-description-lists
#+begin_src css
.lilac-description-list-entry {
    padding: 0.2em 0.5em 0.5em 0.5em;
    border-style: solid;
    border-width: 1px;
    border-radius: 5px;
    border-color: var(--clear);
}

.org-dl .active {
    __NREF__css-active-item-headline
}
#+end_src

*** Custom HTML "head" section

If a user wants to use a custom Google web font, they have to make the HTML page
pull it in in the =<head>= part of the page. This requires modifying the HTML.
In order to facilitate this, we provide a replaceable piece of text that can be
swapped out for the value that the user can provide. Specifically, we inject the
line =<!-- LILAC_HTML_HEAD -->= into the HTML, and this can be replaced by the
value of the =lilac-html-head= variable in Emacs Lisp (which can be provided by
the user when they invoke the =lilac-publish= function).

#+name: __NREF__lilac-publish-inject-custom-html-head
#+begin_src emacs-lisp
(if (boundp 'lilac-html-head)
    (lilac-replace-from-to-html
     "<!-- LILAC_HTML_HEAD -->"
     lilac-html-head))
#+end_src

** JavaScript

We use JavaScript to make the HTML document more useful. The primary concern is
to make it easier to navigate around the various intra-document links.

#+name: lilac.js
#+caption: lilac.js
#+begin_src js :tangle lilac.js :eval no
__NREF__js-automatically-link-headlines
__NREF__js-toc-scrollspy
__NREF__js-highlight-link-destination
__NREF__js-scroll-to-history-item
#+end_src

In the[[* Create =lilac.theme= file][=lilac.theme=]] file, we include =lilac.js= and also jQuery
because we depend on it.

#+name: __NREF__lilac-theme-js
#+begin_src org
,#+HTML_HEAD: <script src="https://code.jquery.com/jquery-3.6.4.min.js"></script>
,#+HTML_HEAD: <script src="lilac.js"></script>
#+end_src

