developer-guide.org
** Autogenerate CSS for syntax highlighting of source code blocks

See [[https://emacs.stackexchange.com/questions/31439/how-to-get-colored-syntax-highlighting-of-code-blocks-in-asynchronous-org-mode-e][this]], specifically https://emacs.stackexchange.com/a/36759.

Generate =syntax-highlighting.css= and quit emacs. This function is designed to
be run from the command line on a fresh emacs instance (dedicated OS process).
Unfortunately, by itself it is almost useless (see
[[__NREF__enable-syntax-highlighting-from-batch-mode][=__NREF__enable-syntax-highlighting-from-batch-mode=]]), because there appears to
be a [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=61521][bug]] in Emacs 28 which [[https://emacs.stackexchange.com/questions/75814/org-html-htmlize-generate-css-not-generating-styles][breaks]] =org-html-htmlize-generate-css=.

#+name: __NREF__lilac_dot_el-autogenerate-css
#+begin_src emacs-lisp
(defun lilac-gen-css-and-exit ()
  (font-lock-flush)
  (font-lock-fontify-buffer)
  (org-html-htmlize-generate-css)
  (with-current-buffer "*html*"
    (write-file "syntax-highlighting.css"))
  (kill-emacs))

;; Without this, lilac-gen-css-and-exit produces a near-empty CSS file.
__NREF__enable-syntax-highlighting-from-batch-mode
#+end_src

Sadly, =lilac-gen-css-and-exit= by itself generates a near-blank CSS file.
So we have to use code from [[https://emacs.stackexchange.com/questions/38437/org-mode-batch-export-missing-syntax-highlighting][here]]:

#+name: __NREF__enable-syntax-highlighting-from-batch-mode
#+begin_src emacs-lisp
(require 'font-lock)
(require 'subr-x) ;; for `when-let'

(unless (boundp 'maximal-integer)
  (defconst maximal-integer (lsh -1 -1)
    "Maximal integer value representable natively in emacs lisp."))

(defun face-spec-default (spec)
  "Get list containing at most the default entry of face SPEC.
Return nil if SPEC has no default entry."
  (let* ((first (car-safe spec))
     (display (car-safe first)))
    (when (eq display 'default)
      (list (car-safe spec)))))

(defun face-spec-min-color (display-atts)
  "Get min-color entry of DISPLAY-ATTS pair from face spec."
  (let* ((display (car-safe display-atts)))
    (or (car-safe (cdr (assoc 'min-colors display)))
    maximal-integer)))

(defun face-spec-highest-color (spec)
  "Search face SPEC for highest color.
That means the DISPLAY entry of SPEC
with class 'color and highest min-color value."
  (let ((color-list (cl-remove-if-not
             (lambda (display-atts)
               (when-let ((display (car-safe display-atts))
                  (class (and (listp display)
                          (assoc 'class display)))
                  (background (assoc 'background display)))
             (and (member 'light (cdr background))
                  (member 'color (cdr class)))))
             spec)))
    (cl-reduce (lambda (display-atts1 display-atts2)
         (if (> (face-spec-min-color display-atts1)
            (face-spec-min-color display-atts2))
             display-atts1
           display-atts2))
           (cdr color-list)
           :initial-value (car color-list))))

(defun face-spec-t (spec)
  "Search face SPEC for fall back."
  (cl-find-if (lambda (display-atts)
        (eq (car-safe display-atts) t))
          spec))

; This is slightly tweaked from the original, because the incoming "face" value
; can look like (fixed-pitch face-name) --- so we take the second element.
(defun my-face-attribute (face attribute &optional frame inherit)
  "Get FACE ATTRIBUTE from `face-user-default-spec' and not from
`face-attribute'."
  (let*
    ((face-spec (face-user-default-spec (if (listp face)
                                            (car (cdr face))
                                          face)))
     (display-attr (or (face-spec-highest-color face-spec)
               (face-spec-t face-spec)))
     (attr (cdr display-attr))
     (val (or (plist-get attr attribute)
              (car-safe (cdr (assoc attribute attr))))))
    (when (and (null (eq attribute :inherit))
           (null val))
      (let ((inherited-face (my-face-attribute face :inherit)))
    (when (and inherited-face
           (null (eq inherited-face 'unspecified)))
      (setq val (my-face-attribute inherited-face attribute)))))
    (or val 'unspecified)))

(advice-add 'face-attribute :override #'my-face-attribute)
#+end_src

** Misc settings

*** Use HTML5 export, not XML (to un-break MathJax)

By default on Org 9.6, MathJax settings (JavaScript snippet) gets wrapped in a
CDATA tag, and we run into the same problem described on this email that has
gone unanswered:
https://www.mail-archive.com/emacs-orgmode@gnu.org/msg140821.html. It appears
that this is because the document is exported as XML, not HTML. Setting the
document type to =html5=, as below, appears to make the CDATA tag magically
disappear.

#+header: :noweb-ref __NREF__lilac_dot_el-misc
#+begin_src emacs-lisp
(setq org-html-doctype "html5")
#+end_src

*** Set citeproc styles folder

For some reason we cannot specify citeproc styles based on a relative path in
our Org file. The solution is to set the =org-cite-csl-styles-dir= variable. See
[[https://list.orgmode.org/CAFyQvY2SZ3jMWo2uwVq0bzTkZGog8eyDSEwhdBZVc8ui9K54vQ@mail.gmail.com/][this post]].

#+header: :noweb-ref __NREF__lilac_dot_el-misc
#+begin_src emacs-lisp
(setq org-cite-csl-styles-dir
      (concat (getenv "LILAC_ROOT") "/deps/styles/"))
#+end_src

*** Code references

**** Define =CodeHighlightOn= and =CodeHighlightOff=

If we don't do this, we get an error because the "coderef" links (the links
inside code blocks, for example =;ref:NSCB_NAME=) will still try to run the
=CodeHighlightOn= and =CodeHighlightOff= JavaScript functions. Turning this
setting on here injects the definitions of these functions into the HTML.

#+header: :noweb-ref __NREF__lilac_dot_el-misc
#+begin_src emacs-lisp
(setq org-html-head-include-scripts t)
#+end_src

**** Do not highlight coderefs

#+name: __NREF__css-coderef-disable-background-color
#+begin_src css
.code-highlighted {
    background-color: inherit;
}
#+end_src

*** Preserve leading whitespace characters on export

#+header: :noweb-ref __NREF__lilac_dot_el-misc
#+begin_src emacs-lisp
(setq org-src-preserve-indentation t)
#+end_src

*** Set tab width to 4 spaces

This matters for languages that require tabs, such as Makefiles.

#+header: :noweb-ref __NREF__lilac_dot_el-misc
#+begin_src emacs-lisp
(setq-default tab-width 4)
#+end_src

*** Disable backups

Disable backup files for =lilac.el= (that look like =lilac.el~=) when we invoke
Emacs from the [[Makefile][Makefile]].

#+header: :noweb-ref __NREF__lilac_dot_el-misc
#+begin_src emacs-lisp
(setq make-backup-files nil)
#+end_src

*** Profiling

We don't use this very often, but it's mainly for determining cost centers for
weaving and tangling.

#+header: :noweb-ref __NREF__lilac_dot_el-misc
#+begin_src emacs-lisp
(defun lilac-publish-profile ()
  (interactive)
  (profiler-start 'cpu)
  (lilac-publish)
  (profiler-stop)
  (profiler-report)
  (profiler-report-write-profile "emacs-profile-weave.txt") t)

(defun lilac-tangle-profile ()
  (interactive)
  (profiler-start 'cpu)
  (org-babel-tangle)
  (profiler-stop)
  (profiler-report)
  (profiler-report-write-profile "emacs-profile-tangle.txt") t)
#+end_src

** Imports

If we want syntax-highlighting to work for a code block, that code block's major
mode (language) must be loaded in here.

#+name: __NREF__lilac_dot_el-imports
#+begin_src emacs-lisp
;; Built-in packages (distributed with Emacs).
(require 'elisp-mode)

(defun lilac-load (p)
  (add-to-list 'load-path
    (concat (getenv "LILAC_ROOT") p)))

;; Third-party packages (checked in as Git submodules)
(lilac-load "/deps/elisp/s.el")
(require 's)
(lilac-load "/deps/elisp/compat.el")
(require 'compat)
(lilac-load "/deps/elisp/dash.el")
(require 'dash)
(lilac-load "/deps/elisp/dr-qubit.org")
(lilac-load "/deps/elisp/f.el")
(lilac-load "/deps/elisp/parsebib")
(lilac-load "/deps/elisp/citeproc-el")
(require 'citeproc)
(require 'oc-csl)
(lilac-load "/deps/elisp/emacs-htmlize")
(require 'htmlize)
(lilac-load "/deps/elisp/magit/lisp")
(require 'magit-section)
(lilac-load "/deps/elisp/nix-mode")
(require 'nix-mode)
(lilac-load "/deps/elisp/elquery")
(require 'elquery)
#+end_src

** Additional (hand-tweaked) CSS

We add some additional CSS tweaks on top of what we get from Org.

#+name: lilac.css
#+caption: lilac.css
#+begin_src css :tangle lilac.css
__NREF__css-general
__NREF__css-headline-font-size
__NREF__css-coderef-disable-background-color
__NREF__css-source-code-section-headlines
__NREF__css-source-code-block-body
__NREF__css-source-code-block-captions
__NREF__css-source-code-block-child-link-from-parent
__NREF__css-sidenotes
__NREF__css-description-lists
__NREF__css-bibliography
__NREF__css-toc
__NREF__css-active-non-toc-item
#+end_src

*** Colors and fonts

We define colors and fonts in one place and reuse them throughout the rest of
the CSS, with the =var()= function.

#+begin_sidenote
This would be an excellent candidate to copy/paste/tweak into your own
=lilac-override.css= file to tweak any of the colors or fonts used by Lilac.
#+end_sidenote

#+header: :noweb-ref __NREF__css-general
#+begin_src css
:root {
    --bg: #fff;
    --fg: #000;
    --bg-code: #f7f7f7;
    --border-code: #777;
    --border-light: #ccc;
    --fg-link: #0000ff;
    --fg-nref-link: #21618c;
    --bg-nref-link: #d8f6ff;
    --fg-nref-link-hover: #7d3c98;
    --bg-nref-link-hover: #f8e9ff;
    --fg-toc-item: green;
    --bg-toc-item: #f1ffef;
    --fg-heading: black;
    --clear: rgba(255, 255, 255, 0);
    --font-serif: "Source Serif Pro", serif;
    --font-sans: "Source Sans Pro", sans;
    --font-mono: "Source Code Pro", monospace;
}
#+end_src

*** General body text

#+header: :noweb-ref __NREF__css-general
#+begin_src css
body {
    font-size: 1.25em;
    width: 800px;
    margin-left: 310px;
    overflow-x: hidden;
    background-color: var(--bg);
    color: var(--fg);
}

body, p, li, legend {
    font-family: var(--font-serif);
}

h2, h3, h4, h5, h6 {
    margin: 1em 0 0 -4px;
    padding: 0 4px;
    display: inline-block;
    border-style: solid;
    border-width: 1px;
    border-color: var(--clear);
}

h1, h2, h3, h4, h5, h6, dt {
    font-family: var(--font-sans);
}

h3, h4, h5, h6 {
    font-weight: normal;
}

p, li {
    line-height: 1.2em;
}

p, ol, ul {
    margin-top: 0;
    margin-bottom: 0;
    padding-top: 1em;
}

li {
    margin-bottom: 0;
}
#+end_src

*** Headline font sizes

#+header: :noweb-ref __NREF__css-headline-font-size
#+begin_src css
h1 {
    font-size: 3em;
}

h2 {
    font-size: 2.4em;
}

h3 {
    font-size: 2em;
}

h4 {
    font-size: 1.6em;
}

h5 {
    font-size: 1.2em;
}

h6 {
    font-size: 1em;
}
#+end_src

**** Title font

#+header: :noweb-ref __NREF__css-general
#+begin_src css
h1.title {
    font-family: "Source Serif Pro", serif;
    font-size: 60pt;
    margin-top: 0.4em;
    margin-bottom: 0;
}
#+end_src

*** Tables

#+header: :noweb-ref __NREF__css-general
#+begin_src css
table {
    margin: 1em auto 0em auto;
    border-spacing: 0;
    border-radius: 4px;
    border: 1px solid var(--border-code);
    border-collapse: unset;
    overflow: hidden;
}

th, td {
    padding: 3px 6px;
    border-right: 1px solid var(--border-code);
    border-bottom: 1px solid var(--border-code);
}

th:last-child, td:last-child  {
    border-right: none;
}

tr:last-child td {
    border-bottom: none;
}

thead {
    background-color: var(--bg-code);
}
#+end_src

*** Description lists

#+header: :noweb-ref __NREF__css-general
#+begin_src css
dl {
    margin: 0;
    padding-top: 1em;
}
#+end_src

*** Images

#+header: :noweb-ref __NREF__css-general
#+begin_src css
img {
    display: block;
    margin: 0 auto;
}
#+end_src

